
        // let year = ['spring', 'summer', 'autumn', 'winter'];
        // year.forEach((item, index ) =>{
        // //  перечисляет элементы массива
        //     console.log(item, index);
        // })
// -------------------------------------------------------------------------------------------------------------------------
        // let a = '12';
        // let b = '1';
        // let c = a + b;

        // console.log(c);
        // примеры 
// -------------------------------------------------------------------------------------------------------------------------
        // let a = 12;
        // let b = 5;

        // if(a > 20 && b < 6) {
        //         // Если а больше нуля и б меньше 6 будет true и сработает этот вариант
        //         console.log("Hello");
        // } else {
        //         console.log('a is false');
        // }

        // примеры использования true , else 
// -------------------------------------------------------------------------------------------------------------------------
        // let person = {
        //         firstName: "John",
        //         lastName: "Smith",
        //         age: 30
        // };

        // console.log(person.firstName);

        // пример использования обьектов и вызова обьекта 
        // -------------------------------------------------------------------------------------------------------------------------

        // function addTwoNumbers(a, b) {
        //         let c = a + b;  
        //         console.log(c);
                // Все взаимодейстия с функцией - в функции
        // }
        // Создание функции

        // addTwoNumbers(2, 5);
        // addTwoNumbers(12 ,15);
        // выведет 2 числа подряд - 7 и 27
        // -------------------------------------------------------------------------------------------------------------------------

        //   function addTwoNumbers(a, b) {
        //         let c = a + b;  
        //         return c;
                // Все взаимодейстия с функцией - в функции
        // }
        // Создание функции

//        let resultA = addTwoNumbers(2, 5);
//        let resultB =addTwoNumbers(12 ,15);

//        console.log(resultA);
//        Так делать , если нужен один результат 

        // let result = addTwoNumbers(addTwoNumbers(2, 5), 10);

        // console.log(result);

        // Т.к. тут 2 функции , вначале складываеться 2 и 5 , а потом добавляеться 10 - итог 17
        // -------------------------------------------------------------------------------------------------------------------------

        // let person = {
        //         firstName: "John",
        //         lastName: "Smith",
        //         age: 30,
        //         getName: function() {
        //         let name = this.firstName + ' ' + this.lastName;
        //         return name;
                // Функция ссылаеться на первый обьект имя и на второй обьект - фамилия , складывает их , в данном случае записывает рядом и следующая строчка возвращает получившееся значение
        //         }
        // };

        // console.log(person.getName());
        // ссылаеться на обьект с параметрами и вытаскивает значение функции